tap "kjuq/tap"

brew "bash"
brew "bat"
brew "coreutils"
brew "curl"
brew "dust"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "lazygit"
brew "less"
brew "mas"
brew "nano"
brew "neovim"
brew "node"
brew "pass"
brew "python"
brew "ripgrep"
brew "tmux"
brew "trash-cli"
brew "w3m"
brew "zoxide"

brew "kjuq/tap/osc52"

cask "alacritty"
cask "betterdisplay"
cask "hammerspoon"
cask "jump-desktop-connect"
cask "linearmouse"
cask "raycast"
cask "vivaldi"

cask "homebrew/cask-fonts/font-hack-nerd-font"

mas "AdGuard for Safari", id: 1440147259
mas "BetterSnapTool", id: 417375580
mas "Glance", id: 1564688210
mas "Vimlike", id: 1584519802
