tap "kjuq/tap"

brew "bash"
brew "bat"
brew "coreutils"
brew "curl"
brew "dust"
brew "exa"
brew "fd"
brew "fish"
brew "fzf"
brew "gcc"
brew "gh"
brew "gist"
brew "git"
brew "git-delta"
brew "gitui"
brew "gmailctl"
brew "lazygit"
brew "less"
brew "mackup"
brew "marp-cli"
brew "mas"
brew "nano"
brew "neovim"
brew "nnn"
brew "node"
brew "python"
brew "rename"
brew "ripgrep"
brew "spotify-tui"
brew "tailscale"
brew "tmux"
brew "trash-cli"
brew "viu"
brew "w3m"
brew "wget"
brew "zoxide"

brew "kjuq/tap/bitsstdcpp"

cask "betterdisplay"
cask "bettertouchtool"
cask "docker"
cask "google-japanese-ime"
cask "iina"
cask "jump-desktop-connect"
cask "linearmouse"
cask "raycast"
cask "splashtop-streamer"
cask "vivaldi"
cask "wezterm"

cask "homebrew/cask-fonts/font-hack-nerd-font"

mas "AdGuard for Safari", id: 1440147259
mas "Glance", id: 1564688210
mas "Vimlike", id: 1584519802

